xml-z-php.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="setProducts" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <SOAP-ENV:Body>
        <ns1:setProducts>
            <setProducts xsi:type="ns1:requestType">
                <authenticate xsi:type="ns1:authenticateType">
                    <system_key xsi:type="xsd:string">3dd29bb4c0ff6be11430eaea050b9e3524ef4873</system_key>
                    <system_login xsi:type="xsd:string">login</system_login>
                </authenticate>
                <params xsi:type="ns1:paramsType">
                    <settings xsi:type="ns1:settingsType">
                        <modification_type xsi:type="xsd:string">edit</modification_type>
                    </settings>
                    <products SOAP-ENC:arrayType="ns1:productType[2]" xsi:type="ns1:productsType">
                        <item xsi:type="ns1:productType">
                            <id xsi:type="xsd:int">1175014091</id>
                            <retail_price xsi:type="xsd:float">22.5</retail_price>
                            <sizes SOAP-ENC:arrayType="ns1:sizeType[1]" xsi:type="ns1:sizesType">
                                <item xsi:type="ns1:sizeType">
                                    <size_id xsi:type="xsd:string">uniw</size_id>
                                    <quantity xsi:type="ns1:quantityType">
                                        <stocks SOAP-ENC:arrayType="ns1:stockType[2]" xsi:type="ns1:stocksType">
                                            <item xsi:type="ns1:stockType">
                                                <stock_id xsi:type="xsd:int">1</stock_id>
                                                <quantity xsi:type="xsd:decimal">10</quantity>
                                            </item>
                                            <item xsi:type="ns1:stockType">
                                                <stock_id xsi:type="xsd:int">2</stock_id>
                                                <quantity_add xsi:type="xsd:decimal">5</quantity_add>
                                            </item>
                                        </stocks>
                                    </quantity>
                                </item>
                            </sizes>
                        </item>
                        <item xsi:type="ns1:productType">
                            <product_sizecode xsi:type="xsd:string">ABCD</product_sizecode>
                            <note xsi:type="xsd:string">produkt edytowany przez API</note>
                            <product_sizecode_data xsi:type="ns1:product_sizecodeType">
                                <retail_price xsi:type="xsd:float">86.99</retail_price>
                                <wholesale_price xsi:type="xsd:float">70</wholesale_price>
                                <quantity xsi:type="ns1:quantityType">
                                    <stocks SOAP-ENC:arrayType="ns1:stockType[2]" xsi:type="ns1:stocksType">
                                        <item xsi:type="ns1:stockType">
                                            <stock_id xsi:type="xsd:int">1</stock_id>
                                            <quantity xsi:type="xsd:decimal">25</quantity>
                                        </item>
                                        <item xsi:type="ns1:stockType">
                                            <stock_id xsi:type="xsd:int">2</stock_id>
                                            <quantity_add xsi:type="xsd:decimal">5</quantity_add>
                                        </item>
                                    </stocks>
                                </quantity>
                            </product_sizecode_data>
                            <name xsi:type="ns1:ndlType">
                                <languages SOAP-ENC:arrayType="ns1:languageType[1]" xsi:type="ns1:languagesTypeArray">
                                    <item xsi:type="ns1:languageType">
                                        <language_id xsi:type="xsd:string">pol</language_id>
                                        <value xsi:type="xsd:string">nazwa produktu</value>
                                    </item>
                                </languages>
                            </name>
                            <description xsi:type="ns1:ndlType">
                                <languages SOAP-ENC:arrayType="ns1:languageType[1]" xsi:type="ns1:languagesTypeArray">
                                    <item xsi:type="ns1:languageType">
                                        <language_id xsi:type="xsd:string">pol</language_id>
                                        <value xsi:type="xsd:string">przykladowy opis</value>
                                    </item>
                                </languages>
                            </description>
                            <long_description xsi:type="ns1:ndlType">
                                <languages SOAP-ENC:arrayType="ns1:languageType[1]" xsi:type="ns1:languagesTypeArray">
                                    <item xsi:type="ns1:languageType">
                                        <language_id xsi:type="xsd:string">pol</language_id>
                                        <value xsi:type="xsd:string">przykladowy opis</value>
                                    </item>
                                </languages>
                            </long_description>
                        </item>
                    </products>
                </params>
            </setProducts>
        </ns1:setProducts>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>